# Data wragling (joining)
Group by

Handling missing values

In [1]:
import numpy as np
import pandas as pd
data=pd.Series(np.random.randn(12),
              index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd','c','e','f'],
                    [1,2,3,1,2,3,1,2,3,3,4,2]])
data

a  1   -1.312301
   2   -0.165409
   3    0.155103
b  1    0.320292
   2   -0.941231
c  3    0.002282
   1    1.920120
d  2   -0.953385
   3   -0.532584
c  3    0.404867
e  4   -0.377913
f  2    0.608270
dtype: float64

In [9]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('c', 3),
            ('c', 1),
            ('d', 2),
            ('d', 3),
            ('c', 3),
            ('e', 4),
            ('f', 2)],
           )

In [11]:
#you can easyly extract 
data['c']

3    1.454555
1    0.586199
3    0.163702
dtype: float64

In [12]:
data[:,2]

a    1.056135
b   -2.396923
d   -0.205586
f   -1.478068
dtype: float64

In [13]:
data.loc[['b','f']]

b  1    0.106651
   2   -2.396923
f  2   -1.478068
dtype: float64

In [24]:
data_1=pd.DataFrame(np.arange(12).reshape((4,3)),
                   index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                   columns=[['Ohio', 'Ohio', 'Colorado'],
                            ['Green', 'Red', 'Green']])
data_1

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [8]:
data_11=pd.read_csv("examples/missing.csv")
print(data_11)
sentinel={'message':['NA','Foo']}
result=(data_11,sentinel)
result

       somethingba  b  c    d message  Unnamed: 5
one              1  2  3  4.0   hello         NaN
two              1  5  3  1.0   world         NaN
three            8  9  5  NaN     Nan         NaN

(       somethingba  b  c    d message  Unnamed: 5
 one              1  2  3  4.0   hello         NaN
 two              1  5  3  1.0   world         NaN
 three            8  9  5  NaN     Nan         NaN, {'message': ['NA', 'Foo']})

In [10]:
data_11=pd.read_csv("examples/missing.csv",na_values=sentinel)
data_11

       somethingba  b  c    d message  Unnamed: 5
one              1  2  3  4.0   hello         NaN
two              1  5  3  1.0   world         NaN
three            8  9  5  NaN     Nan         NaN

In [25]:
data_1.index.names=['key1','key2'] 
#data_1.index.names=['state','color'] 
data_1

           Ohio     Colorado
          Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [34]:
data_1.index.names=['state','color'] 
data_1

             Ohio     Colorado
            Green Red    Green
state color
a     1         0   1        2
      2         3   4        5
b     1         6   7        8
      2         9  10       11

In [35]:
data_1['Colorado']

             Green
state color
a     1          2
      2          5
b     1          8
      2         11

In [36]:
data_1['Ohio']

             Green  Red
state color
a     1          0    1
      2          3    4
b     1          6    7
      2          9   10

In [37]:
#data_1.swaplevel('key1','key2')

In [38]:
data_1.swaplevel('state','color')

             Ohio     Colorado
            Green Red    Green
color state
1     a         0   1        2
2     a         3   4        5
1     b         6   7        8
2     b         9  10       11

In [46]:
data_1.sort_index(level=1)

             Ohio     Colorado
            Green Red    Green
state color
a     1         0   1        2
b     1         6   7        8
a     2         3   4        5
b     2         9  10       11

In [51]:
data_1.swaplevel(0,1).sort_index(level=0)

             Ohio     Colorado
            Green Red    Green
color state
1     a         0   1        2
      b         6   7        8
2     a         3   4        5
      b         9  10       11

# Summary Statistics by Level
DataFrame and Series have a level
option in which you can specify the level you want to aggregate by on a particular
axis.

In [53]:
data_1.sum(level='color')

       Ohio     Colorado
      Green Red    Green
color
1         6   8       10
2        12  14       16

In [55]:
data_1

             Ohio     Colorado
            Green Red    Green
state color
a     1         0   1        2
      2         3   4        5
b     1         6   7        8
      2         9  10       11

In [54]:
data_1.sum(level='state')#column vise addition

       Ohio     Colorado
      Green Red    Green
state
a         3   5        7
b        15  17       19

In [65]:
dtx=pd.read_csv('examples/exm7.csv')
dtx

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [16]:
dtl=pd.DataFrame(np.arange(1000).reshape((100,10)),
            columns=['one','two','three','four','five','six','seven','eight','nine','ten'])
dtl

    one  two  three  four  five  six  seven  eight  nine  ten
0     0    1      2     3     4    5      6      7     8    9
1    10   11     12    13    14   15     16     17    18   19
2    20   21     22    23    24   25     26     27    28   29
3    30   31     32    33    34   35     36     37    38   39
4    40   41     42    43    44   45     46     47    48   49
..  ...  ...    ...   ...   ...  ...    ...    ...   ...  ...
95  950  951    952   953   954  955    956    957   958  959
96  960  961    962   963   964  965    966    967   968  969
97  970  971    972   973   974  975    976    977   978  979
98  980  981    982   983   984  985    986    987   988  989
99  990  991    992   993   994  995    996    997   998  999

[100 rows x 10 columns]

In [27]:
datt=pd.read_csv('titanic/test.csv',nrows=200)
datt

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
195,1087,3,"Karlsson, Mr. Julius Konrad Eugen",male,33.0,0,0,347465,7.8542,NaN,S
196,1088,1,"Spedden, Master. Robert Douglas",male,6.0,0,2,16966,134.5000,E34,C
197,1089,3,"Nilsson, Miss. Berta Olivia",female,18.0,0,0,347066,7.7750,NaN,S
198,1090,2,"Baimbrigge, Mr. Charles Robert",male,23.0,0,0,C.A. 31030,10.5000,NaN,S
199,1091,3,"Rasmussen, Mrs. (Lena Jacobsen Solvang)",female,NaN,0,0,65305,8.1125,NaN,S

In [41]:
import csv
f=open('examples/sample3.csv')
reader=csv.reader(f)
for line in reader:
    print(line)

['key1', 'key2', 'value1', 'value2']
['one', 'a', '1', '2']
['one', 'b', '3', '4']
['one', 'c', '5', '6']
['one', 'd', '7', '8']
['two', 'a', '9', '10']
['two', 'b', '11', '12']
['two', 'c', '13', '14']
['two', 'd', '15', '16']

In [52]:

with open('examples/sample3.csv') as g:
    lines=list(csv.reader(g))
header,values=lines[0],[1]